# Feature Scaling
- Standardization

In [3]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [4]:
os.chdir("G:\Machine-Learning-Revision")

In [39]:
df = pd.read_csv('civil_data.csv')

In [40]:
df.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,?,77053,HS-grad,9,Widowed,?,Not-in-family,White,Female,0,4356,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
2,66,?,186061,Some-college,10,Widowed,?,Unmarried,Black,Female,0,4356,40,United-States,<=50K
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K

In [41]:
new_df=df.iloc[:,2:5]

In [42]:
new_df.sample(5)

       fnlwgt     education  education.num
11966  228190       HS-grad              9
31171   78855       HS-grad              9
17210  339358       5th-6th              3
27757  330571       HS-grad              9
12753  188069  Some-college             10

> Train test split

In [45]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(new_df.drop('education', axis=1),
                                                    df['income'],
                                                    test_size=0.3,
                                                    random_state=0)

X_train.shape, X_test.shape

((22792, 2), (9769, 2))

Apply StandardScaler()

In [46]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

# fit the scaler to the train set, it will learn the parameters
scaler.fit(X_train)

# transform train and test sets
X_train_scaled = scaler.transform(X_train)
X_test_scaled = scaler.transform(X_test)

In [47]:
scaler.mean_

array([1.89912320e+05, 1.00875746e+01])

In [48]:
X_train

       fnlwgt  education.num
32098   31627             13
25206  236391              9
23491  194710             10
12367  273929              9
7054    99527             14
...       ...            ...
13123  282095             10
19648  279721              9
9845    51961              8
10799  115323             14
2732   224531              9

[22792 rows x 2 columns]

In [49]:
X_train_scaled

array([[-1.4942788 ,  1.13389375],
       [ 0.43877794, -0.4234251 ],
       [ 0.04529208, -0.03409539],
       ...,
       [-1.30231744, -0.81275481],
       [-0.70415399,  1.52322346],
       [ 0.32681464, -0.4234251 ]])

In [50]:
X_train_scaled = pd.DataFrame(X_train_scaled, columns=X_train.columns)
X_test_scaled = pd.DataFrame(X_test_scaled, columns=X_test.columns)

In [51]:
np.round(X_train.describe(), 1)

          fnlwgt  education.num
count    22792.0        22792.0
mean    189912.3           10.1
std     105929.9            2.6
min      12285.0            1.0
25%     117741.5            9.0
50%     178615.0           10.0
75%     237317.0           12.0
max    1455435.0           16.0

In [52]:
np.round(X_train_scaled.describe(), 1)

        fnlwgt  education.num
count  22792.0        22792.0
mean       0.0           -0.0
std        1.0            1.0
min       -1.7           -3.5
25%       -0.7           -0.4
50%       -0.1           -0.0
75%        0.4            0.7
max       11.9            2.3